In [3]:
import numpy as np

import pandas as pd

In [4]:
dates = pd.date_range("20130101", periods=6)

dates

df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

df

                   A         B         C         D
2013-01-01 -1.998986  1.296197 -1.465014  1.131087
2013-01-02  1.088610 -0.509100  0.242955  0.630851
2013-01-03 -1.142412 -0.454925  0.008690 -1.998270
2013-01-04 -1.427400  0.697093 -0.610099  0.630660
2013-01-05  0.593233  1.986355 -0.280266 -0.658003
2013-01-06 -0.793436 -1.012109 -0.901957 -0.839979

In [5]:
In [9]: df2 = pd.DataFrame(
   ...:     {
   ...:         "A": 1.0,
   ...:         "B": pd.Timestamp("20130102"),
   ...:         "C": pd.Series(1, index=list(range(4)), dtype="float32"),
   ...:         "D": np.array([3] * 4, dtype="int32"),
   ...:         "E": pd.Categorical(["test", "train", "test", "train"]),
   ...:         "F": "foo",
   ...:     }
   ...: )
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
df.head()








df.tail(3)

                   A         B         C         D
2013-01-04 -1.427400  0.697093 -0.610099  0.630660
2013-01-05  0.593233  1.986355 -0.280266 -0.658003
2013-01-06 -0.793436 -1.012109 -0.901957 -0.839979

In [8]:
df.index





df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [9]:
df.to_numpy()

array([[-1.99898614,  1.29619702, -1.46501398,  1.13108745],
       [ 1.08860995, -0.50910043,  0.24295532,  0.63085055],
       [-1.14241198, -0.45492514,  0.00869047, -1.99827024],
       [-1.42740011,  0.69709286, -0.61009875,  0.63066047],
       [ 0.5932332 ,  1.98635506, -0.28026632, -0.6580031 ],
       [-0.79343615, -1.01210942, -0.90195722, -0.83997949]])

In [10]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.613399  0.333918 -0.500948 -0.183942
std    1.203953  1.177554  0.626733  1.183526
min   -1.998986 -1.012109 -1.465014 -1.998270
25%   -1.356153 -0.495557 -0.828993 -0.794485
50%   -0.967924  0.121084 -0.445183 -0.013671
75%    0.246566  1.146421 -0.063549  0.630803
max    1.088610  1.986355  0.242955  1.131087

In [12]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.998986    1.088610   -1.142412   -1.427400    0.593233   -0.793436
B    1.296197   -0.509100   -0.454925    0.697093    1.986355   -1.012109
C   -1.465014    0.242955    0.008690   -0.610099   -0.280266   -0.901957
D    1.131087    0.630851   -1.998270    0.630660   -0.658003   -0.839979

In [13]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.131087 -1.465014  1.296197 -1.998986
2013-01-02  0.630851  0.242955 -0.509100  1.088610
2013-01-03 -1.998270  0.008690 -0.454925 -1.142412
2013-01-04  0.630660 -0.610099  0.697093 -1.427400
2013-01-05 -0.658003 -0.280266  1.986355  0.593233
2013-01-06 -0.839979 -0.901957 -1.012109 -0.793436

In [14]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06 -0.793436 -1.012109 -0.901957 -0.839979
2013-01-02  1.088610 -0.509100  0.242955  0.630851
2013-01-03 -1.142412 -0.454925  0.008690 -1.998270
2013-01-04 -1.427400  0.697093 -0.610099  0.630660
2013-01-01 -1.998986  1.296197 -1.465014  1.131087
2013-01-05  0.593233  1.986355 -0.280266 -0.658003

In [15]:
df["A"]

2013-01-01   -1.998986
2013-01-02    1.088610
2013-01-03   -1.142412
2013-01-04   -1.427400
2013-01-05    0.593233
2013-01-06   -0.793436
Freq: D, Name: A, dtype: float64

In [16]:
df[0:3]






df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  1.088610 -0.509100  0.242955  0.630851
2013-01-03 -1.142412 -0.454925  0.008690 -1.998270
2013-01-04 -1.427400  0.697093 -0.610099  0.630660

In [19]:
df.iloc[0, 1]

1.2961970206538955

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.998986  1.296197 -1.465014  1.131087
2013-01-02  1.088610 -0.509100  0.242955  0.630851
2013-01-03 -1.142412 -0.454925  0.008690 -1.998270

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  1.088610 -0.509100  0.242955  0.630851
2013-01-03 -1.142412 -0.454925  0.008690 -1.998270
2013-01-04 -1.427400  0.697093 -0.610099  0.630660

In [23]:
df.loc[dates[0]]

A   -1.998986
B    1.296197
C   -1.465014
D    1.131087
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -1.998986  1.296197
2013-01-02  1.088610 -0.509100
2013-01-03 -1.142412 -0.454925
2013-01-04 -1.427400  0.697093
2013-01-05  0.593233  1.986355
2013-01-06 -0.793436 -1.012109

In [25]:
df.loc[dates[0], "A"] #loc

-1.9989861423389406

In [27]:
df.at[dates[0], "A"] #at

-1.9989861423389406

In [28]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.427400  0.697093
2013-01-05  0.593233  1.986355

In [29]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.088610 -0.509100  0.242955  0.630851
2013-01-03 -1.142412 -0.454925  0.008690 -1.998270

In [30]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.296197 -1.465014
2013-01-02 -0.509100  0.242955
2013-01-03 -0.454925  0.008690
2013-01-04  0.697093 -0.610099
2013-01-05  1.986355 -0.280266
2013-01-06 -1.012109 -0.901957

In [31]:
df.iloc[1, 1] #iloc

-0.509100425716454

In [33]:
df.iat[1, 1] #iat

-0.509100425716454

In [34]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-02  1.088610 -0.509100  0.242955  0.630851
2013-01-05  0.593233  1.986355 -0.280266 -0.658003

In [35]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.296197       NaN  1.131087
2013-01-02  1.088610       NaN  0.242955  0.630851
2013-01-03       NaN       NaN  0.008690       NaN
2013-01-04       NaN  0.697093       NaN  0.630660
2013-01-05  0.593233  1.986355       NaN       NaN
2013-01-06       NaN       NaN       NaN       NaN

In [36]:
df2 = df.copy()

df2["E"] = ["one", "one", "two", "three", "four", "three"]

df2

                   A         B         C         D      E
2013-01-01 -1.998986  1.296197 -1.465014  1.131087    one
2013-01-02  1.088610 -0.509100  0.242955  0.630851    one
2013-01-03 -1.142412 -0.454925  0.008690 -1.998270    two
2013-01-04 -1.427400  0.697093 -0.610099  0.630660  three
2013-01-05  0.593233  1.986355 -0.280266 -0.658003   four
2013-01-06 -0.793436 -1.012109 -0.901957 -0.839979  three

In [37]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [39]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D
2013-01-01  0.000000  1.296197 -1.465014  1.131087
2013-01-02  1.088610 -0.509100  0.242955  0.630851
2013-01-03 -1.142412 -0.454925  0.008690 -1.998270
2013-01-04 -1.427400  0.697093 -0.610099  0.630660
2013-01-05  0.593233  1.986355 -0.280266 -0.658003
2013-01-06 -0.793436 -1.012109 -0.901957 -0.839979

In [40]:
df.iat[0, 1] = 0

In [41]:
df

                   A         B         C         D
2013-01-01  0.000000  0.000000 -1.465014  1.131087
2013-01-02  1.088610 -0.509100  0.242955  0.630851
2013-01-03 -1.142412 -0.454925  0.008690 -1.998270
2013-01-04 -1.427400  0.697093 -0.610099  0.630660
2013-01-05  0.593233  1.986355 -0.280266 -0.658003
2013-01-06 -0.793436 -1.012109 -0.901957 -0.839979

In [42]:
df2 = df.copy()

df2[df2 > 0] = -df2

df2

                   A         B         C         D
2013-01-01  0.000000  0.000000 -1.465014 -1.131087
2013-01-02 -1.088610 -0.509100 -0.242955 -0.630851
2013-01-03 -1.142412 -0.454925 -0.008690 -1.998270
2013-01-04 -1.427400 -0.697093 -0.610099 -0.630660
2013-01-05 -0.593233 -1.986355 -0.280266 -0.658003
2013-01-06 -0.793436 -1.012109 -0.901957 -0.839979

In [43]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

df1.loc[dates[0] : dates[1], "E"] = 1

df1

                   A         B         C         D    E
2013-01-01  0.000000  0.000000 -1.465014  1.131087  1.0
2013-01-02  1.088610 -0.509100  0.242955  0.630851  1.0
2013-01-03 -1.142412 -0.454925  0.008690 -1.998270  NaN
2013-01-04 -1.427400  0.697093 -0.610099  0.630660  NaN

In [44]:
df1.dropna(how="any")

                  A       B         C         D    E
2013-01-01  0.00000  0.0000 -1.465014  1.131087  1.0
2013-01-02  1.08861 -0.5091  0.242955  0.630851  1.0

In [45]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  0.000000  0.000000 -1.465014  1.131087  1.0
2013-01-02  1.088610 -0.509100  0.242955  0.630851  1.0
2013-01-03 -1.142412 -0.454925  0.008690 -1.998270  5.0
2013-01-04 -1.427400  0.697093 -0.610099  0.630660  5.0

In [46]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True